/***
* ÅÅĞòjsÊ¹ÓÃËµÃ÷£º
* 1¡¢Ò³Ãæµ÷ÓÃ·½·¨£¬ÔÚwindow.onloadº¯ÊıÀïÃæ¼ÓÈë³õÊ¼»¯´úÂë£ºinitHjhSort(DisplayTable);ÆäÖĞDisplayTableÎªĞèÒªÅÅĞòµÄ±í¸ñµÄidÖµ
* 2¡¢Èç¹û²»ÏëÄ³Ò»ĞĞ²ÎÓëÅÅĞò£¬ÀıÈçºÏ¼ÆĞĞµÈ£¬Ôò½«¸ÃĞĞµÄtitleÊôĞÔÖµÉèÖÃÎªhjhNoSort£¬Ôò²»²ÎÓëÅÅĞò£¬ÀıÈç<tr title="hjhNoSort">
* ¿É²ÎÕÕÒ³Ãæ£ºyys\nfpj\jxkh\ckgzrykh.jsp½øĞĞÉèÖÃ
* 3¡¢Èç¹ûÒ³ÃæÊÇ¶à±íÍ·µÄ»°£¬ĞèÒªÖ¸¶¨Êµ¼ÊµÄÁĞÖµ£¬·½Ê½ÀıÈç£º<th width="50" class="{trueColIndex:6}">ÆÀ¼ÛÂÊ%</th> ÔÚclassÊôĞÔÀïÃæÖÆ¶¨ÕæÕıµÄtrueColIndexµÄÖµÎª6¡£

|c0|c1|c2   |c3      |c4| 
|  |  |--+--+--+--+--|  | 
|  |  |c5|c6|c7|c8|c9|  |

|0 |1 |0 |1 |0 |1 |2 |4 |             ³ÌĞòÈ¡µÃµÄÁĞÖµ
|0 |1 |2 |3 |4 |5 |6 |7 |             Êµ¼ÊÁĞÖµ
ÒÔÉÏÃæµÄ±í¸ñÎªÀı£ºc0¡¢c1ÁĞµÄÊµ¼ÊÁĞÖµºÍÈ¡µÄÁĞÖµÒ»ÖÂ£¬ÊÇ0ºÍ1£¬ËùÒÔ²»ĞèÒªÖ¸¶¨trueColIndex¡£
µ«ÊÇc4µ½c9µÄÁĞÖµ¾ù²»ºÍÊµ¼ÊÁĞÖµÏàÍ¬£¬ĞèÒªÖÆ¶¨¡£c5µÄÊµ¼ÊÁĞÖµÎª2£¬c6Îª3£¬c7Îª4£¬c8Îª5£¬c9Îª6£¬c4Îª7¡£

* ¿É²ÎÕÕÒ³Ãæ£ºyys\nfpj\jxkh\mydcjwh.jsp½øĞĞÉèÖÃ
***/


//ÊÇ·ñÕûÊı(°üÀ¨¸ºÊı)
function isInt(strVar) {
    var str = strVar.match(/^(-|\+)?\d+$/);
    if (str == null) {
        return false;
    }
    else {
        return true;
    }
}

//ÕıÕûÊı
function isPlusInt(strVar) {
    var str = strVar.match(/^\d+$/);
    if (str == null) {
        return false;
    }
    else {
        return true;
    }
}

//¸ºÕûÊı
function isNegative(strVar) {
    var str = strVar.match(/^-\d+$/);
    if (str == null) {
        return false;
    }
    else {
        return true;
    }
}

/** 
 * ¼ì²éÈÕÆÚÊ±¼äµÄºÏ·¨ĞÔ ÈÕÆÚ±ØĞëÎª"2006-02-06¡¢2006-2-06"
 * @param str Òª¼ì²éµÄÈÕÆÚ×Ö·û´®¡£
 * @return ÕıÈ··µ»Øtrue£¬·´Ö®false
 */
function checkDate(str) {
    var reg = /^(\d+)-(\d{1,2})-(\d{1,2})$/;
    var r = str.match(reg);
    if (r == null)return false;
    r[2] = r[2] - 1;
    var d = new Date(r[1], r[2], r[3]);
    if (d.getFullYear() != r[1])return false;
    if (d.getMonth() != r[2])return false;
    if (d.getDate() != r[3])return false;
    return true;
}

/**
 * ¸ñÊ½»¯ÈÕÆÚÈç:yyyy-mmÀàĞÍ,¶Ô²»¹æ·¶µÄÀàĞÍ½øĞĞ¸ñÊ½»¯Èç£º2006-1¸ñÊ½»¯³É2006-01
 * @param	obj	OjbectÀàĞÍ
 * @return	·µ»Ø¸ñÊ½»¯ºÃµÄ×Ö·û´®
 */
function formatYm(obj) {
    if (obj == undefined) {
        return;
    }
    var temp = obj.value;
    //Ğ£ÑéÊÇ·ñÊÇÈÕÆÚÀàĞÍ
    var reg = /^(\d+)-(\d{1,2})$/;
    var r = temp.match(reg);
    if (r == null) {
        //alert("·ÇÈÕÆÚ!");
        return;
    }
    var array = temp.split("-");
    var ym = array[0] + "-";

    ym = ym + (array[1].length > 1 ? array[1]:"0" + array[1])
    obj.value = ym;
}

//ÅĞ¶Ï×Ö·ûÓÉ×ÖÄ¸ºÍÊı×Ö×é³É
function isZmSz(strVar) {
    var str = strVar.match(/^[0-9a-zA-Z]+$/);
    if (str == null) {
        return false;
    }
    else {
        return true;
    }
}

/*
* Ğ£ÑéÊÇ·ñÊÇµç»°
*
* @param strVar
* @param ÊÇ·µ»Øtrue£¬·´Ö®false
*/
function isPhone(strVar) {
    var str = strVar.match(/(^[0-9]{3,4}\-[0-9]{3,8}$)|(^[0-9]{3,8}$)|(^\([0-9]{3,4}\)[0-9]{3,8}$)|(^0{0,1}13[0-9]{9}$)/);
    if (str == null) {
        return false;
    }
    else {
        return true;
    }
}


//LTrim(string):È¥³ı×ó±ßµÄ¿Õ¸ñ
function LTrim(str){
	if (sstr == null || sstr == undefined) {
		return sstr;
	}
    var whitespace = new String("\t\n\r");
    var s = new String(str);

    if (whitespace.indexOf(s.charAt(0)) != -1)
    {
        var j = 0, i = s.length;
        while (j < i && whitespace.indexOf(s.charAt(j)) != -1)
        {
            j++;
        }
        s = s.substring(j, i);
    }
    return s;
}


//RTrim(string):È¥³ıÓÒ±ßµÄ¿Õ¸ñ
function RTrim(str){
	if (sstr == null || sstr == undefined) {
		return sstr;
	}
    var whitespace = new String("\t\n\r");
    var s = new String(str);
    if (whitespace.indexOf(s.charAt(s.length - 1)) != -1)
    {
        var i = s.length - 1;
        while (i >= 0 && whitespace.indexOf(s.charAt(i)) != -1)
        {
            i--;
        }
        s = s.substring(0, i + 1);
    }
    return s;
}


function comdecimal(thestr){
    var dolft = parseFloat(thestr);
    thestr = new String(dolft);

    var dotlst = thestr.indexOf(".");
    if (dotlst == 0) {
        thestr = "0" + thestr;
    }

    var dot2nd = thestr.lastIndexOf(".");
    //ÒÔÏÂÇé¿öÔòÉèÖÃÎª0.00
    if ((thestr == 0.00) || (thestr == 0) || (thestr == '')) {
        return "0.00";
    }
    //Èç¹ûÊÇÕûÊıÔòÉèÖÃ
    if (dotlst == -1) {
        return thestr + ".00";
    }
    //ËùÌîÊı¾İ²»Õı³££¬ÖØĞÂÖÃÁã
    if (dotlst != dot2nd) {
        return "0.00";
    }
    var intpart = thestr.substring(0, dotlst);
    var decpart = thestr.substring(dot2nd + 1);
    if (decpart.length > 2) {
        //Ğ¡ÊıµãºóµÚÈıÎ»Óë5Ïà±È½Ï£¬´óÓÚ½øÎ»£¬·ñÔò²»½øÎ»¡£
        var decpart3 = decpart.substring(2, 3);
        decpart = decpart.substring(0, 2);
        if (parseInt(decpart3) >= 5) {
            if (decpart.substring(0, 1) == 0) {
                decpart = parseInt(decpart.substring(1, 2)) + 1;
            } else {
                decpart = parseInt(decpart) + 1;
            }
        }
        decpart = decpart.toString();
        if (decpart.length == 1) {
            decpart = "0" + decpart;
        } else {
            if (decpart.length == 3) {
                decpart = "00";
                intpart = Math.round(parseFloat(intpart) + 1);
            }

        }
        var thestr = intpart + "." + decpart;


    } else {
        if (decpart.length == 1) {
            decpart = decpart + "0";
            var thestr = intpart + "." + decpart;
            //OK!
        }

    }
    return thestr;

}


function IsNumber(string) {
    var number;
    var i_blank = string.indexOf(" ");
    if (string == null)
        return false;
    if (string.length == 0)
        return false;
    if (i_blank != -1)
        return false;
    number = new Number(string);

    if (isNaN(number)) {
        return false;
    }
    else {
        return true;
    }
}

//×ª»¯ÎªËÄÉáÎåÈë
function conRound(varFloat) {

    //	alert("dfdfd:"+varFloat);
    return (Math.round(varFloat * 100) / 100);

}


function trim(sstr)
{
	if (sstr == null || sstr == undefined) {
		return sstr;
	}
    var astr = "";
    var dstr = "";
    var flag = 0;
    for (i = 0; i < sstr.length; i++)
    {
        if ((sstr.charAt(i) != ' ') || (flag != 0))
        {
            dstr = dstr + sstr.charAt(i);
            flag = 1;
        }
    }
    flag = 0;
    for (i = dstr.length - 1; i >= 0; i--)
    {
        if ((dstr.charAt(i) != ' ') || (flag != 0))
        {
            astr = astr + dstr.charAt(i);
            flag = 1;
        }
    }
    dstr = "";
    for (i = astr.length - 1; i >= 0; i--)
        dstr = dstr + astr.charAt(i);

    return dstr;
}



/**
 * Ğ£Ñé×Ö·û´®³¤¶È
 *
 * @param	strObj	String¶ÔÏó,²»Îª¿Õ»ònull£¬Ê¹ÓÃÊ±ÓÃthis¼´¿É
 * @param	len		ĞèÒªĞ£ÑéµÄÎ»Êı£¬²»Îª¿Õ±ØĞëÎªÊı×Ö
 * @return	´óÓÚlen·µ»Øtrue,·´Ö®false
 */
function checkStr(strObj, len) {

    if (strObj == undefined) {
        return;
    }

    //alert("obj="+strObj+" value="+strObj.value);
    if (getStrByteLength(strObj.value) > len) {
        return true;
    }
    return false;
}


/**
 * µÃµ½UNICODE×Ö·û´®µÄÊµ¼Ê³¤¶È£¬µ¥¸öÖĞÎÄ×Ö·û³¤¶ÈÎª2
 *
 * @param str ×Ö·û´®
 * @return ³¤¶È
 */
function getStrByteLength(str) {
    var len = str.length;

    for (var i = 0; i < str.length; i++) {
        if (str.charCodeAt(i) > 255) {
            len ++;
        }
    }
    //	alert("×Ö·û´®³¤¶È="+len);
    return len;
}

/** 
 * °ÑÒ»¸ö¸¡µãÊı£¬ÒÔĞ¡Êıµãºó¼¸Î»ËÄÉáÎåÈë
 *
 * @param srcValue ÒªÉáÎ»µÄÖµ
 * @param iCount   ÒªÉáÎ»µ½Ğ¡Êıµãºó¼¸Î»
 * @return ËÄÉáÎåÈëºóµÄÊı
 */
function round(srcValuef, iCount) {
    var srcValue = srcValuef;
    var zs = true;
    //ÅĞ¶ÏÊÇ·ñÊÇ¸ºÊı
    if (srcValue < 0)
    {
        srcValue = Math.abs(srcValue);
        zs = false;
    }
    var iB = Math.pow(10, iCount);
    //ÓĞÊ±³Ë100½á¹ûÒ²²»¾«È·
    var value1 = srcValue * iB;

    var anumber = new Array();
    var anumber1 = new Array();

    var fvalue = value1;
    var value2 = value1.toString();
    var idot = value2.indexOf(".");
    //Èç¹ûÊÇĞ¡Êı
    if (idot != -1) {
        anumber = srcValue.toString().split(".");
        //Èç¹ûÊÇ¿ÆÑ§¼ÆÊı·¨½á¹û
        if (anumber[1].indexOf("e") != -1) {
            return Math.round(value1) / iB;
        }
        anumber1 = value2.split(".");
        if (anumber[1].length <= iCount) {
            return parseFloat(srcValuef, 10);
        }
        var fvalue3 = parseInt(anumber[1].substring(iCount, iCount + 1), 10);

        if (fvalue3 >= 5) {
            fvalue = parseInt(anumber1[0], 10) + 1;
        } else {
            //¶ÔÓÚ´«ÈëµÄĞÎÈç111.834999999998 µÄ´¦Àí£¨´«ÈëµÄ¼ÆËã½á¹û¾ÍÊÇ´íÎóµÄ£¬Ó¦Îª111.835£©
            if (fvalue3 == 4 && anumber[1].length > 10 && parseInt(anumber[1].substring(iCount + 1, iCount + 2), 10) == 9) {
                fvalue = parseInt(anumber1[0], 10) + 1;
            } else {
                fvalue = parseInt(anumber1[0], 10);
            }
        }
    }
    //Èç¹ûÊÇ¸ºÊı¾ÍÓÃ0¼õËÄÉáÎåÈëµÄ¾ø¶ÔÖµ
    if (zs) {
        return fvalue / iB;
    } else {
        return 0 - fvalue / iB;
    }
}


/**
 * Ğ£ÑéCheckbox¼°RadioÊÇ·ñÑ¡ÖĞ
 *
 * @param  obj checkbox»òradio¶ÔÏó
 * @return {0,1,2} 0´ú±í´Ë¶ÔÏóÃ»ÓĞ¶¨Òå(²»´æÔÚ)£¬1´ú±íÑ¡ÖĞ£¬2´ú±íÃ»ÓĞÑ¡ÖĞ
 */
function validateBox(obj) {
    var theFlag
    //Ğ£Ñé¶ÔÏóÊÇ·ñ´æÔÚ
    if (obj == undefined) {
        return 0;
    }
    //Ğ£Ñé¶ÔÏóÊÇ·ñÊÇÊı×é
    if (obj.length == undefined) {
        //alert("value="+obj.checked);
        if (obj.checked == true) {
            return 1;
        }
        //Ã»ÓĞÑ¡ÖĞ
        return 2;
    }
    else {
        //alert("value2="+obj.checked);
        for (var i = 0; i < obj.length; i++) {
            if (obj[i].checked == true) {
                return 1;
            }
        }
        //Ã»ÓĞÑ¡ÖĞ
        return 2;
    }
    //end if
}

/**
 * »ñÈ¡Checkbox»òRadio±»Ñ¡ÖĞµÄÖµ
 *
 * @param  obj checkbox»òradio¶ÔÏó
 * @return ·µ»ØÑ¡ÖĞµÄÖµËù¹¹³ÉµÄÊı×é£¬Ã»ÓĞÑ¡ÖĞÖµÊ±£¬·µ»ØÒ»¸ö¿ÕµÄArray
 */
function getCheckedArray(obj){
	var array = new Array();
	//¶ÔÏóÊÇ·ñ´æÔÚ
    if(obj == undefined){
    }
    //¶ÔÏóÊÇ·ñÊÇÊı×é 
    else if(obj.length == undefined && obj.checked){
         array.push(obj.value);
    }
    //Êı×é
    else{
     	for (var i = 0; i < obj.length; i++) {
          if (obj[i].checked) {
              array.push(obj[i].value);
          }
     	}
    }
    return	array;	
}


/**
 * ¶Ôcheckbox½øĞĞ·´Ñ¡
 *
 * @param	obj		checkbox¶ÔÏó
 */
function reverseCheckbox(obj) {
    //Ğ£Ñé¶ÔÏóÊÇ·ñ´æÔÚ
    if (obj == undefined) {
        return;
    }
    //Ğ£Ñé¶ÔÏóÊÇ·ñÊÇÊı×é
    if (obj.length == undefined) {
        //alert("value="+obj.checked);
        if (obj.checked == true) {
            obj.checked = false;
        }
        else {
        	if(obj.disabled!=true)
            obj.checked = true;
        }
    }
    else {
        //alert("value2="+obj.checked);
        for (var i = 0; i < obj.length; i++) {
            if (obj[i].checked == true) {
                obj[i].checked = false;
            }
            else {
            if(obj[i].disabled!=true)
                obj[i].checked = true;
            }
        }
    }
    //end if
}

/**
 * ¼ì²éÎÄ¼şµÄÀàĞÍÊÇ·ñÎªxls£¬txt
 * @param  path  ÎÄ¼şÂ·¾¶  modify by yjj
 */
function checkFileType(filePath, fileType) {
    var theFlag = true;
    var url;
    if (filePath == "") {
        showAlert("ÇëÑ¡ÔñÎÄ¼ş£¡");
        theFlag = false;
        return theFlag;
    }
    var splitString = filePath.split(".");
    var string = splitString.toString();
    var type = string.substring(string.indexOf(",") + 1);
    if (fileType == "xls") {
        url = /^(x|X)(l|L)(s|S)$/;
        if (! type.match(url)) {
            showAlert("ËùÑ¡ÔñµÄÎÄ¼ş²»ÊôÓÚEcxelÎÄ¼ş£¬Çë¼ì²éºóÔÙÊÔ£¡£¡");
            theFlag = false;
            return theFlag;
        }
    }

    if (fileType == "dbf") {
        url = /^(d|D)(b|B)(f|F)$/;
        if (! type.match(url)) {
            showAlert("ËùÑ¡ÔñµÄÎÄ¼ş²»ÊôÓÚdbfÎÄ¼ş£¬Çë¼ì²éºóÔÙÊÔ£¡");
            theFlag = false;
            return theFlag;
        }
    }

    if (fileType == "txt") {
        url = /^(t|T)(x|X)(t|T)$/;
        if (! type.match(url)) {
            showAlert("ËùÑ¡ÔñµÄÎÄ¼ş²»ÊôÓÚÎÄ±¾ÎÄ¼ş£¬Çë¼ì²éºóÔÙÊÔ£¡");
            theFlag = false;
            return theFlag;
        }
    }
    return theFlag;
}

//²âÊÔÊÇ·ñÊı×ÖĞÍ  number(m,n)  modify by yjj
function testNumber(number, m, n, max, min)
{
	//reStr = /^-?(0|(([1-9])\d{0,8}))?(\.\d{0,2})?$/;
	if(m > n)
		reStr = "^-?(0|(([1-9])\\d{0," + (m-1-n) + "}))?(\\.\\d{0," + n + "})?$";
	else
		reStr = "^-?0?(\\.\\d{0," + n + "})?$";

	re = new RegExp(reStr, "gi");
	if(!re.test(number))
		return false;

	if(max != null && number > max)
		return false;

	if(min != null && number < min)
		return false;

	return true;
}

var charPYStr = "°¡°¢°£°¤°¥°¦°§°¨°©°ª°«°¬°­°®°¯°°°±°²°³°´°µ°¶°·°¸°¹°º°»°¼°½°¾°¿°À°Á°Â°Ã°Ä°Å°Æ°Ç°È°É°Ê°Ë°Ì°Í°Î°Ï°Ğ°Ñ°Ò°Ó°Ô°Õ°Ö°×°Ø°Ù°Ú°Û°Ü°İ°Ş°ß°à°á°â°ã°ä°å°æ°ç°è°é°ê°ë°ì°í°î°ï°ğ°ñ°ò°ó°ô°õ°ö°÷°ø°ù°ú°û°ü°ı°ş±¡±¢±£±¤±¥±¦±§±¨±©±ª±«±¬±­±®±¯±°±±±²±³±´±µ±¶±·±¸±¹±º±»±¼±½±¾±¿±À±Á±Â±Ã±Ä±Å±Æ±Ç±È±É±Ê±Ë±Ì±Í±Î±Ï±Ğ±Ñ±Ò±Ó±Ô±Õ±Ö±×±Ø±Ù±Ú±Û±Ü±İ±Ş±ß±à±á±â±ã±ä±å±æ±ç±è±é±ê±ë±ì±í±î±ï±ğ±ñ±ò±ó±ô±õ±ö±÷±ø±ù±ú±û±ü±ı±ş²¡²¢²£²¤²¥²¦²§²¨²©²ª²«²¬²­²®²¯²°²±²²²³²´²µ²¶²·²¸²¹²º²»²¼²½²¾²¿²À²Á²Â²Ã²Ä²Å²Æ²Ç²È²É²Ê²Ë²Ì²Í²Î²Ï²Ğ²Ñ²Ò²Ó²Ô²Õ²Ö²×²Ø²Ù²Ú²Û²Ü²İ²Ş²ß²à²á²â²ã²ä²å²æ²ç²è²é²ê²ë²ì²í²î²ï²ğ²ñ²ò²ó²ô²õ²ö²÷²ø²ù²ú²û²ü²ı²ş³¡³¢³£³¤³¥³¦³§³¨³©³ª³«³¬³­³®³¯³°³±³²³³³´³µ³¶³·³¸³¹³º³»³¼³½³¾³¿³À³Á³Â³Ã³Ä³Å³Æ³Ç³È³É³Ê³Ë³Ì³Í³Î³Ï³Ğ³Ñ³Ò³Ó³Ô³Õ³Ö³×³Ø³Ù³Ú³Û³Ü³İ³Ş³ß³à³á³â³ã³ä³å³æ³ç³è³é³ê³ë³ì³í³î³ï³ğ³ñ³ò³ó³ô³õ³ö³÷³ø³ù³ú³û³ü³ı³ş´¡´¢´£´¤´¥´¦´§´¨´©´ª´«´¬´­´®´¯´°´±´²´³´´´µ´¶´·´¸´¹´º´»´¼´½´¾´¿´À´Á´Â´Ã´Ä´Å´Æ´Ç´È´É´Ê´Ë´Ì´Í´Î´Ï´Ğ´Ñ´Ò´Ó´Ô´Õ´Ö´×´Ø´Ù´Ú´Û´Ü´İ´Ş´ß´à´á´â´ã´ä´å´æ´ç´è´é´ê´ë´ì´í´î´ï´ğ´ñ´ò´ó´ô´õ´ö´÷´ø´ù´ú´û´ü´ı´şµ¡µ¢µ£µ¤µ¥µ¦µ§µ¨µ©µªµ«µ¬µ­µ®µ¯µ°µ±µ²µ³µ´µµµ¶µ·µ¸µ¹µºµ»µ¼µ½µ¾µ¿µÀµÁµÂµÃµÄµÅµÆµÇµÈµÉµÊµËµÌµÍµÎµÏµĞµÑµÒµÓµÔµÕµÖµ×µØµÙµÚµÛµÜµİµŞµßµàµáµâµãµäµåµæµçµèµéµêµëµìµíµîµïµğµñµòµóµôµõµöµ÷µøµùµúµûµüµıµş¶¡¶¢¶£¶¤¶¥¶¦¶§¶¨¶©¶ª¶«¶¬¶­¶®¶¯¶°¶±¶²¶³¶´¶µ¶¶¶·¶¸¶¹¶º¶»¶¼¶½¶¾¶¿¶À¶Á¶Â¶Ã¶Ä¶Å¶Æ¶Ç¶È¶É¶Ê¶Ë¶Ì¶Í¶Î¶Ï¶Ğ¶Ñ¶Ò¶Ó¶Ô¶Õ¶Ö¶×¶Ø¶Ù¶Ú¶Û¶Ü¶İ¶Ş¶ß¶à¶á¶â¶ã¶ä¶å¶æ¶ç¶è¶é¶ê¶ë¶ì¶í¶î¶ï¶ğ¶ñ¶ò¶ó¶ô¶õ¶ö¶÷¶ø¶ù¶ú¶û¶ü¶ı¶ş·¡·¢·£·¤·¥·¦·§·¨·©·ª·«·¬·­·®·¯·°·±·²·³·´·µ·¶···¸·¹·º·»·¼·½·¾·¿·À·Á·Â·Ã·Ä·Å·Æ·Ç·È·É·Ê·Ë·Ì·Í·Î·Ï·Ğ·Ñ·Ò·Ó·Ô·Õ·Ö·×·Ø·Ù·Ú·Û·Ü·İ·Ş·ß·à·á·â·ã·ä·å·æ·ç·è·é·ê·ë·ì·í·î·ï·ğ·ñ·ò·ó·ô·õ·ö·÷·ø·ù·ú·û·ü·ı·ş¸¡¸¢¸£¸¤¸¥¸¦¸§¸¨¸©¸ª¸«¸¬¸­¸®¸¯¸°¸±¸²¸³¸´¸µ¸¶¸·¸¸¸¹¸º¸»¸¼¸½¸¾¸¿¸À¸Á¸Â¸Ã¸Ä¸Å¸Æ¸Ç¸È¸É¸Ê¸Ë¸Ì¸Í¸Î¸Ï¸Ğ¸Ñ¸Ò¸Ó¸Ô¸Õ¸Ö¸×¸Ø¸Ù¸Ú¸Û¸Ü¸İ¸Ş¸ß¸à¸á¸â¸ã¸ä¸å¸æ¸ç¸è¸é¸ê¸ë¸ì¸í¸î¸ï¸ğ¸ñ¸ò¸ó¸ô¸õ¸ö¸÷¸ø¸ù¸ú¸û¸ü¸ı¸ş¹¡¹¢¹£¹¤¹¥¹¦¹§¹¨¹©¹ª¹«¹¬¹­¹®¹¯¹°¹±¹²¹³¹´¹µ¹¶¹·¹¸¹¹¹º¹»¹¼¹½¹¾¹¿¹À¹Á¹Â¹Ã¹Ä¹Å¹Æ¹Ç¹È¹É¹Ê¹Ë¹Ì¹Í¹Î¹Ï¹Ğ¹Ñ¹Ò¹Ó¹Ô¹Õ¹Ö¹×¹Ø¹Ù¹Ú¹Û¹Ü¹İ¹Ş¹ß¹à¹á¹â¹ã¹ä¹å¹æ¹ç¹è¹é¹ê¹ë¹ì¹í¹î¹ï¹ğ¹ñ¹ò¹ó¹ô¹õ¹ö¹÷¹ø¹ù¹ú¹û¹ü¹ı¹şº¡º¢º£º¤º¥º¦º§º¨º©ºªº«º¬º­º®º¯º°º±º²º³º´ºµº¶º·º¸º¹ººº»º¼º½º¾º¿ºÀºÁºÂºÃºÄºÅºÆºÇºÈºÉºÊºËºÌºÍºÎºÏºĞºÑºÒºÓºÔºÕºÖº×ºØºÙºÚºÛºÜºİºŞºßºàºáºâºãºäºåºæºçºèºéºêºëºìºíºîºïºğºñºòºóºôºõºöº÷ºøºùºúºûºüºıºş»¡»¢»£»¤»¥»¦»§»¨»©»ª»«»¬»­»®»¯»°»±»²»³»´»µ»¶»·»¸»¹»º»»»¼»½»¾»¿»À»Á»Â»Ã»Ä»Å»Æ»Ç»È»É»Ê»Ë»Ì»Í»Î»Ï»Ğ»Ñ»Ò»Ó»Ô»Õ»Ö»×»Ø»Ù»Ú»Û»Ü»İ»Ş»ß»à»á»â»ã»ä»å»æ»ç»è»é»ê»ë»ì»í»î»ï»ğ»ñ»ò»ó»ô»õ»ö»÷»ø»ù»ú»û»ü»ı»ş¼¡¼¢¼£¼¤¼¥¼¦¼§¼¨¼©¼ª¼«¼¬¼­¼®¼¯¼°¼±¼²¼³¼´¼µ¼¶¼·¼¸¼¹¼º¼»¼¼¼½¼¾¼¿¼À¼Á¼Â¼Ã¼Ä¼Å¼Æ¼Ç¼È¼É¼Ê¼Ë¼Ì¼Í¼Î¼Ï¼Ğ¼Ñ¼Ò¼Ó¼Ô¼Õ¼Ö¼×¼Ø¼Ù¼Ú¼Û¼Ü¼İ¼Ş¼ß¼à¼á¼â¼ã¼ä¼å¼æ¼ç¼è¼é¼ê¼ë¼ì¼í¼î¼ï¼ğ¼ñ¼ò¼ó¼ô¼õ¼ö¼÷¼ø¼ù¼ú¼û¼ü¼ı¼ş½¡½¢½£½¤½¥½¦½§½¨½©½ª½«½¬½­½®½¯½°½±½²½³½´½µ½¶½·½¸½¹½º½»½¼½½½¾½¿½À½Á½Â½Ã½Ä½Å½Æ½Ç½È½É½Ê½Ë½Ì½Í½Î½Ï½Ğ½Ñ½Ò½Ó½Ô½Õ½Ö½×½Ø½Ù½Ú¾¥¾¦¾§¾¨¾©¾ª¾«¾¬¾­¾®¾¯¾°¾±¾²¾³¾´¾µ¾¶¾·¾¸¾¹¾º¾»¾¼¾½¾¾¾¿¾À¾Á¾Â¾Ã¾Ä¾Å¾Æ¾Ç¾È¾É¾Ê¾Ë¾Ì¾Í¾Î¾Ï¾Ğ¾Ñ¾Ò¾Ó¾Ô¾Õ¾Ö¾×¾Ø¾Ù¾Ú¾Û¾Ü¾İ¾Ş¾ß¾à¾á¾â¾ã¾ä¾å¾æ¾ç¾è¾é¾ê¾ë¾ì¾í¾î¾ï¾ğ¾ñ¾ò¾ó¾ô½Û½Ü½İ½Ş½ß½à½á½â½ã½ä½å½æ½ç½è½é½ê½ë½ì½í½î½ï½ğ½ñ½ò½ó½ô½õ½ö½÷½ø½ù½ú½û½ü½ı½ş¾¡¾¢¾£¾¤¾õ¾ö¾÷¾ø¾ù¾ú¾û¾ü¾ı¾ş¿¡¿¢¿£¿¤¿¥¿¦¿§¿¨¿©¿ª¿«¿¬¿­¿®¿¯¿°¿±¿²¿³¿´¿µ¿¶¿·¿¸¿¹¿º¿»¿¼¿½¿¾¿¿¿À¿Á¿Â¿Ã¿Ä¿Å¿Æ¿Ç¿È¿É¿Ê¿Ë¿Ì¿Í¿Î¿Ï¿Ğ¿Ñ¿Ò¿Ó¿Ô¿Õ¿Ö¿×¿Ø¿Ù¿Ú¿Û¿Ü¿İ¿Ş¿ß¿à¿á¿â¿ã¿ä¿å¿æ¿ç¿è¿é¿ê¿ë¿ì¿í¿î¿ï¿ğ¿ñ¿ò¿ó¿ô¿õ¿ö¿÷¿ø¿ù¿ú¿û¿ü¿ı¿şÀ¡À¢À£À¤À¥À¦À§À¨À©ÀªÀ«À¬À­À®À¯À°À±À²À³À´ÀµÀ¶À·À¸À¹ÀºÀ»À¼À½À¾À¿ÀÀÀÁÀÂÀÃÀÄÀÅÀÆÀÇÀÈÀÉÀÊÀËÀÌÀÍÀÎÀÏÀĞÀÑÀÒÀÓÀÔÀÕÀÖÀ×ÀØÀÙÀÚÀÛÀÜÀİÀŞÀßÀàÀáÀâÀãÀäÀåÀæÀçÀèÀéÀêÀëÀìÀíÀîÀïÀğÀñÀòÀóÀôÀõÀöÀ÷ÀøÀùÀúÀûÀüÀıÀşÁ¡Á¢Á£Á¤Á¥Á¦Á§Á¨Á©ÁªÁ«Á¬Á­Á®Á¯Á°Á±Á²Á³Á´ÁµÁ¶Á·Á¸Á¹ÁºÁ»Á¼Á½Á¾Á¿ÁÀÁÁÁÂÁÃÁÄÁÅÁÆÁÇÁÈÁÉÁÊÁËÁÌÁÍÁÎÁÏÁĞÁÑÁÒÁÓÁÔÁÕÁÖÁ×ÁØÁÙÁÚÁÛÁÜÁİÁŞÁßÁàÁáÁâÁãÁäÁåÁæÁçÁèÁéÁêÁëÁìÁíÁîÁïÁğÁñÁòÁóÁôÁõÁöÁ÷ÁøÁùÁúÁûÁüÁıÁşÂ¡Â¢Â£Â¤Â¥Â¦Â§Â¨Â©ÂªÂ«Â¬Â­Â®Â¯Â°Â±Â²Â³Â´ÂµÂ¶Â·Â¸Â¹ÂºÂ»Â¼Â½Â¾Â¿ÂÀÂÁÂÂÂÃÂÄÂÅÂÆÂÇÂÈÂÉÂÊÂËÂÌÂÍÂÎÂÏÂĞÂÑÂÒÂÓÂÔÂÕÂÖÂ×ÂØÂÙÂÚÂÛÂÜÂİÂŞÂßÂàÂáÂâÂãÂäÂåÂæÂçÂèÂéÂêÂëÂìÂíÂîÂïÂğÂñÂòÂóÂôÂõÂöÂ÷ÂøÂùÂúÂûÂüÂıÂşÃ¡Ã¢Ã£Ã¤Ã¥Ã¦Ã§Ã¨Ã©ÃªÃ«Ã¬Ã­Ã®Ã¯Ã°Ã±Ã²Ã³Ã´ÃµÃ¶Ã·Ã¸Ã¹ÃºÃ»Ã¼Ã½Ã¾Ã¿ÃÀÃÁÃÂÃÃÃÄÃÅÃÆÃÇÃÈÃÉÃÊÃËÃÌÃÍÃÎÃÏÃĞÃÑÃÒÃÓÃÔÃÕÃÖÃ×ÃØÃÙÃÚÃÛÃÜÃİÃŞÃßÃàÃáÃâÃãÃäÃåÃæÃçÃèÃéÃêÃëÃìÃíÃîÃïÃğÃñÃòÃóÃôÃõÃöÃ÷ÃøÃùÃúÃûÃüÃıÃşÄ¡Ä¢Ä£Ä¤Ä¥Ä¦Ä§Ä¨Ä©ÄªÄ«Ä¬Ä­Ä®Ä¯Ä°Ä±Ä²Ä³Ä´ÄµÄ¶Ä·Ä¸Ä¹ÄºÄ»Ä¼Ä½Ä¾Ä¿ÄÀÄÁÄÂÄÃÄÄÄÅÄÆÄÇÄÈÄÉÄÊÄËÄÌÄÍÄÎÄÏÄĞÄÑÄÒÄÓÄÔÄÕÄÖÄ×ÄØÄÙÄÚÄÛÄÜÄİÄŞÄßÄàÄáÄâÄãÄäÄåÄæÄçÄèÄéÄêÄëÄìÄíÄîÄïÄğÄñÄòÄóÄôÄõÄöÄ÷ÄøÄùÄúÄûÄüÄıÄşÅ¡Å¢Å£Å¤Å¥Å¦Å§Å¨Å©ÅªÅ«Å¬Å­Å®Å¯Å°Å±Å²Å³Å´ÅµÅ¶Å·Å¸Å¹ÅºÅ»Å¼Å½Å¾Å¿ÅÀÅÁÅÂÅÃÅÄÅÅÅÆÅÇÅÈÅÉÅÊÅËÅÌÅÍÅÎÅÏÅĞÅÑÅÒÅÓÅÔÅÕÅÖÅ×ÅØÅÙÅÚÅÛÅÜÅİÅŞÅßÅàÅáÅâÅãÅäÅåÅæÅçÅèÅéÅêÅëÅìÅíÅîÅïÅğÅñÅòÅóÅôÅõÅöÅ÷ÅøÅùÅúÅûÅüÅıÅşÆ¡Æ¢Æ£Æ¤Æ¥Æ¦Æ§Æ¨Æ©ÆªÆ«Æ¬Æ­Æ®Æ¯Æ°Æ±Æ²Æ³Æ´ÆµÆ¶Æ·Æ¸Æ¹ÆºÆ»Æ¼Æ½Æ¾Æ¿ÆÀÆÁÆÂÆÃÆÄÆÅÆÆÆÇÆÈÆÉÆÊÆËÆÌÆÍÆÎÆÏÆĞÆÑÆÒÆÓÆÔÆÕÆÖÆ×ÆØÆÙÆÚÆÛÆÜÆİÆŞÆßÆàÆáÆâÆãÆäÆåÆæÆçÆèÆéÆêÆëÆìÆíÆîÆïÆğÆñÆòÆóÆôÆõÆöÆ÷ÆøÆùÆúÆûÆüÆıÆşÇ¢Ç£Ç¤Ç¥Ç¦Ç§Ç¨Ç©ÇªÇ«Ç¬Ç­Ç®Ç¯Ç°Ç±Ç²Ç³Ç´ÇµÇ¶Ç·Ç¸Ç¹ÇºÇ»Ç¼Ç½Ç¾Ç¿ÇÀÇÁÇÂÇÃÇÄÇÅÇÆÇÇÇÈÇÉÇÊÇËÇÌÇÍÇÎÇÏÇĞÇÑÇÒÇÓÇÔÇÕÇÖÇ×ÇØÇÙÇÚÇÛÇÜÇİÇŞÇßÇàÇáÇâÇãÇäÇåÇæÇçÇèÇéÇêÇëÇìÇíÇîÇïÇğÇñÇòÇóÇôÇõÇöÇ÷ÇøÇùÇúÇûÇüÇıÇşÈ¡È¢È£È¤È¥È¦È§È¨È©ÈªÈ«È¬È­È®È¯È°È±È²È³È´ÈµÈ¶È·È¸È¹ÈºÈ»È¼È½È¾È¿ÈÀÈÁÈÂÈÃÈÄÈÅÈÆÈÇÈÈÈÉÈÊÈËÈÌÈÍÈÎÈÏÈĞÈÑÈÒÈÓÈÔÈÕÈÖÈ×ÈØÈÙÈÚÈÛÈÜÈİÈŞÈßÈàÈáÈâÈãÈäÈåÈæÈçÈèÈéÈêÈëÈìÈíÈîÈïÈğÈñÈòÈóÈôÈõÈöÈ÷ÈøÈùÈúÈûÈüÈıÈşÉ¡É¢É£É¤É¥É¦É§É¨É©ÉªÉ«É¬É­É®É¯É°É±É²É³É´ÉµÉ¶É·É¸É¹ÉºÉ»É¼É½É¾É¿ÉÀÉÁÉÂÉÃÉÄÉÅÉÆÉÇÉÈÉÉÉÊÉËÉÌÉÍÉÎÉÏÉĞÉÑÉÒÉÓÉÔÉÕÉÖÉ×ÉØÉÙÉÚÉÛÉÜÉİÉŞÉßÉàÉáÉâÉãÉäÉåÉæÉçÉèÉéÉêÉëÉìÉíÉîÉïÉğÉñÉòÉóÉôÉõÉöÉ÷ÉøÉùÉúÉûÉüÉıÉşÊ¡Ê¢Ê£Ê¤Ê¥Ê¦Ê§Ê¨Ê©ÊªÊ«Ê¬Ê­Ê®Ê¯Ê°Ê±Ê²Ê³Ê´ÊµÊ¶Ê·Ê¸Ê¹ÊºÊ»Ê¼Ê½Ê¾Ê¿ÊÀÊÁÊÂÊÃÊÄÊÅÊÆÊÇÊÈÊÉÊÊÊËÊÌÊÍÊÎÊÏÊĞÊÑÊÒÊÓÊÔÊÕÊÖÊ×ÊØÊÙÊÚÊÛÊÜÊİÊŞÊßÊàÊáÊâÊãÊäÊåÊæÊçÊèÊéÊêÊëÊìÊíÊîÊïÊğÊñÊòÊóÊôÊõÊöÊ÷ÊøÊùÊúÊûÊüÊıÊşË¡Ë¢Ë£Ë¤Ë¥Ë¦Ë§Ë¨Ë©ËªË«Ë¬Ë­Ë®Ë¯Ë°Ë±Ë²Ë³Ë´ËµË¶Ë·Ë¸Ë¹ËºË»Ë¼Ë½Ë¾Ë¿ËÀËÁËÂËÃËÄËÅËÆËÇËÈËÉËÊËËËÌËÍËÎËÏËĞËÑËÒËÓËÔËÕËÖË×ËØËÙËÚËÛËÜËİËŞËßËàËáËâËãËäËåËæËçËèËéËêËëËìËíËîËïËğËñËòËóËôËõËöË÷ËøËùËúËûËüËıËşÌ¡Ì¢Ì£Ì¤Ì¥Ì¦Ì§Ì¨Ì©ÌªÌ«Ì¬Ì­Ì®Ì¯Ì°Ì±Ì²Ì³Ì´ÌµÌ¶Ì·Ì¸Ì¹ÌºÌ»Ì¼Ì½Ì¾Ì¿ÌÀÌÁÌÂÌÃÌÄÌÅÌÆÌÇÌÈÌÉÌÊÌËÌÌÌÍÌÎÌÏÌĞÌÑÌÒÌÓÌÔÌÕÌÖÌ×ÌØÌÙÌÚÌÛÌÜÌİÌŞÌßÌàÌáÌâÌãÌäÌåÌæÌçÌèÌéÌêÌëÌìÌíÌîÌïÌğÌñÌòÌóÌôÌõÌöÌ÷ÌøÌùÌúÌûÌüÌıÌşÍ¡Í¢Í£Í¤Í¥Í¦Í§Í¨Í©ÍªÍ«Í¬Í­Í®Í¯Í°Í±Í²Í³Í´ÍµÍ¶Í·Í¸Í¹ÍºÍ»Í¼Í½Í¾Í¿ÍÀÍÁÍÂÍÃÍÄÍÅÍÆÍÇÍÈÍÉÍÊÍËÍÌÍÍÍÎÍÏÍĞÍÑÍÒÍÓÍÔÍÕÍÖÍ×ÍØÍÙÍÚÍÛÍÜÍİÍŞÍßÍàÍáÍâÍãÍäÍåÍæÍçÍèÍéÍêÍëÍìÍíÍîÍïÍğÍñÍòÍóÍôÍõÍöÍ÷ÍøÍùÍúÍûÍüÍıÍşÎ¡Î¢Î£Î¤Î¥Î¦Î§Î¨Î©ÎªÎ«Î¬Î­Î®Î¯Î°Î±Î²Î³Î´ÎµÎ¶Î·Î¸Î¹ÎºÎ»Î¼Î½Î¾Î¿ÎÀÎÁÎÂÎÃÎÄÎÅÎÆÎÇÎÈÎÉÎÊÎËÎÌÎÍÎÎÎÏÎĞÎÑÎÒÎÓÎÔÎÕÎÖÎ×ÎØÎÙÎÚÎÛÎÜÎİÎŞÎßÎàÎáÎâÎãÎäÎåÎæÎçÎèÎéÎêÎëÎìÎíÎîÎïÎğÎñÎòÎóÎôÎõÎöÎ÷ÎøÎùÎúÎûÎüÎıÎşÏ¡Ï¢Ï£Ï¤Ï¥Ï¦Ï§Ï¨Ï©ÏªÏ«Ï¬Ï­Ï®Ï¯Ï°Ï±Ï²Ï³Ï´ÏµÏ¶Ï·Ï¸Ï¹ÏºÏ»Ï¼Ï½Ï¾Ï¿ÏÀÏÁÏÂÏÃÏÄÏÅÏÆÏÇÏÈÏÉÏÊÏËÏÌÏÍÏÎÏÏÏĞÏÑÏÒÏÓÏÔÏÕÏÖÏ×ÏØÏÙÏÚÏÛÏÜÏİÏŞÏßÏàÏáÏâÏãÏäÏåÏæÏçÏèÏéÏêÏëÏìÏíÏîÏïÏğÏñÏòÏóÏôÏõÏöÏ÷ÏøÏùÏúÏûÏüÏıÏşĞ¡Ğ¢Ğ£Ğ¤Ğ¥Ğ¦Ğ§Ğ¨Ğ©ĞªĞ«Ğ¬Ğ­Ğ®Ğ¯Ğ°Ğ±Ğ²Ğ³Ğ´ĞµĞ¶Ğ·Ğ¸Ğ¹ĞºĞ»Ğ¼Ğ½Ğ¾Ğ¿ĞÀĞÁĞÂĞÃĞÄĞÅĞÆĞÇĞÈĞÉĞÊĞËĞÌĞÍĞÎĞÏĞĞĞÑĞÒĞÓĞÔĞÕĞÖĞ×ĞØĞÙĞÚĞÛĞÜĞİĞŞĞßĞàĞáĞâĞãĞäĞåĞæĞçĞèĞéĞêĞëĞìĞíĞîĞïĞğĞñĞòĞóĞôĞõĞöĞ÷ĞøĞùĞúĞûĞüĞıĞşÑ¡Ñ¢Ñ£Ñ¤Ñ¥Ñ¦Ñ§Ñ¨Ñ©ÑªÑ«Ñ¬Ñ­Ñ®Ñ¯Ñ°Ñ±Ñ²Ñ³Ñ´ÑµÑ¶Ñ·Ñ¸Ñ¹ÑºÑ»Ñ¼Ñ½Ñ¾Ñ¿ÑÀÑÁÑÂÑÃÑÄÑÅÑÆÑÇÑÈÑÉÑÊÑËÑÌÑÍÑÎÑÏÑĞÑÑÑÒÑÓÑÔÑÕÑÖÑ×ÑØÑÙÑÚÑÛÑÜÑİÑŞÑßÑàÑáÑâÑãÑäÑåÑæÑçÑèÑéÑêÑëÑìÑíÑîÑïÑğÑñÑòÑóÑôÑõÑöÑ÷ÑøÑùÑúÑûÑüÑıÑşÒ¡Ò¢Ò£Ò¤Ò¥Ò¦Ò§Ò¨Ò©ÒªÒ«Ò¬Ò­Ò®Ò¯Ò°Ò±Ò²Ò³Ò´ÒµÒ¶Ò·Ò¸Ò¹ÒºÒ»Ò¼Ò½Ò¾Ò¿ÒÀÒÁÒÂÒÃÒÄÒÅÒÆÒÇÒÈÒÉÒÊÒËÒÌÒÍÒÎÒÏÒĞÒÑÒÒÒÓÒÔÒÕÒÖÒ×ÒØÒÙÒÚÒÛÒÜÒİÒŞÒßÒàÒáÒâÒãÒäÒåÒæÒçÒèÒéÒêÒëÒìÒíÒîÒïÒğÒñÒòÒóÒôÒõÒöÒ÷ÒøÒùÒúÒûÒüÒıÒşÓ¡Ó¢Ó£Ó¤Ó¥Ó¦Ó§Ó¨Ó©ÓªÓ«Ó¬Ó­Ó®Ó¯Ó°Ó±Ó²Ó³Ó´ÓµÓ¶Ó·Ó¸Ó¹ÓºÓ»Ó¼Ó½Ó¾Ó¿ÓÀÓÁÓÂÓÃÓÄÓÅÓÆÓÇÓÈÓÉÓÊÓËÓÌÓÍÓÎÓÏÓĞÓÑÓÒÓÓÓÔÓÕÓÖÓ×ÓØÓÙÓÚÓÛÓÜÓİÓŞÓßÓàÓáÓâÓãÓäÓåÓæÓçÓèÓéÓêÓëÓìÓíÓîÓïÓğÓñÓòÓóÓôÓõÓöÓ÷ÓøÓùÓúÓûÓüÓıÓşÔ¡Ô¢Ô£Ô¤Ô¥Ô¦Ô§Ô¨Ô©ÔªÔ«Ô¬Ô­Ô®Ô¯Ô°Ô±Ô²Ô³Ô´ÔµÔ¶Ô·Ô¸Ô¹ÔºÔ»Ô¼Ô½Ô¾Ô¿ÔÀÔÁÔÂÔÃÔÄÔÅÔÆÔÇÔÈÔÉÔÊÔËÔÌÔÍÔÎÔÏÔĞÔÑÔÒÔÓÔÔÔÕÔÖÔ×ÔØÔÙÔÚÔÛÔÜÔİÔŞÔßÔàÔáÔâÔãÔäÔåÔæÔçÔèÔéÔêÔëÔìÔíÔîÔïÔğÔñÔòÔóÔôÔõÔöÔ÷ÔøÔùÔúÔûÔüÔıÔşÕ¡Õ¢Õ£Õ¤Õ¥Õ¦Õ§Õ¨Õ©ÕªÕ«Õ¬Õ­Õ®Õ¯Õ°Õ±Õ²Õ³Õ´ÕµÕ¶Õ·Õ¸Õ¹ÕºÕ»Õ¼Õ½Õ¾Õ¿ÕÀÕÁÕÂÕÃÕÄÕÅÕÆÕÇÕÈÕÉÕÊÕËÕÌÕÍÕÎÕÏÕĞÕÑÕÒÕÓÕÔÕÕÕÖÕ×ÕØÕÙÕÚÕÛÕÜÕİÕŞÕßÕàÕáÕâÕãÕäÕåÕæÕçÕèÕéÕêÕëÕìÕíÕîÕïÕğÕñÕòÕóÕôÕõÕöÕ÷ÕøÕùÕúÕûÕüÕıÕşÖ¡Ö¢Ö£Ö¤Ö¥Ö¦Ö§Ö¨Ö©ÖªÖ«Ö¬Ö­Ö®Ö¯Ö°Ö±Ö²Ö³Ö´ÖµÖ¶Ö·Ö¸Ö¹ÖºÖ»Ö¼Ö½Ö¾Ö¿ÖÀÖÁÖÂÖÃÖÄÖÅÖÆÖÇÖÈÖÉÖÊÖËÖÌÖÍÖÎÖÏÖĞÖÑÖÒÖÓÖÔÖÕÖÖÖ×ÖØÖÙÖÚÖÛÖÜÖİÖŞÖßÖàÖáÖâÖãÖäÖåÖæÖçÖèÖéÖêÖëÖìÖíÖîÖïÖğÖñÖòÖóÖôÖõÖöÖ÷ÖøÖùÖúÖûÖüÖıÖş×¡×¢×£×¤×¥×¦×§×¨×©×ª×«×¬×­×®×¯×°×±×²×³×´×µ×¶×·×¸×¹×º×»×¼×½×¾×¿×À×Á×Â×Ã×Ä×Å×Æ×Ç×È×É×Ê×Ë×Ì×Í×Î×Ï×Ğ×Ñ×Ò×Ó×Ô×Õ×Ö×××Ø×Ù×Ú×Û×Ü×İ×Ş×ß×à×á×â×ã×ä×å×æ×ç×è×é×ê×ë×ì×í×î×ï×ğ×ñ×ò×ó×ô×õ×ö×÷×ø×ù";
var charBHStr = "Ò»ÒÒ¶¡ÆßÄË¾ÅÁË¶şÈË¶ùÈë°Ë¼¸µ¶µóÁ¦Ê®²·³§ÓÖÍòÕÉÈıÉÏÏÂ¸öÑ¾Íè¾ÃÃ´ÒåÆòÒ²Ï°ÏçÓÚ¿÷ÍöÒÚ·²ÈĞÉ×Ç§ÎÀ²æ¿ÚÍÁÊ¿Ï¦´óÅ®×Ó´çĞ¡Ê¬É½´¨¹¤¼ºÒÑËÈ½í¸É¹ã¹­²ÅÃÅ·ÉÂí²»Óë³ó×¨ÖĞ·áµ¤ÎªÖ®ÎÚÊéÓèÔÆ»¥Îå¾®¿ºÊ²ÈÊ½öÆÍ³ğ½ñ½éÈÔ´ÓÂØ²ÖÔÊÔª¹«ÁùÄÚ¸ÔÈß·ïĞ×·ÖÇĞÈ°°ì¹´ÎğÔÈ»¯Æ¥ÇøÉıÎç±å¶òÌüÀú¼°ÓÑË«·´ÈÉÌìÌ«·ò¿×ÉÙÓÈÒü³ßÍÍ°Í±Ò»Ã¿ªÒıĞÄÒä¸ê»§ÊÖÔúÖ§ÎÄ¶·½ï·½ÎŞÈÕÔ»ÔÂÄ¾Ç·Ö¹´õÎã±ÈÃ«ÊÏÆøË®»ğ×¦¸¸Æ¬ÑÀÅ£È®ÍõÍßÒÕ¼û¼Æ¶©¸¼ÈÏ¼¥±´³µµË³¤¶ÓÎ¤·çÇÒÊÀÇğ±ûÒµ´Ô¶«Ë¿Ö÷Õ§ºõ·¦ÀÖ×ĞÊËËûÕÌ¸¶ÏÉÇª´úÁîÒÔÒÇÃÇĞÖÀ¼È½²áĞ´¶¬·ëÍ¹°¼³ö»÷¿¯¹¦¼ÓÎñ°ü´Ò±±ÔÑ»Ü°ëÕ¼¿¨Â¬Ã®À÷È¥·¢¹Å¾äÁíÖ»½ĞÕÙ°È¶£¿ÉÌ¨Ê·ÓÒÒ¶ºÅË¾Ì¾µğÇôËÄÊ¥´¦ÍâÑëº»Ê§Í·Å«ÄÌÔĞÄşËü¶Ô¶ûÄá×óÇÉ¾ŞÊĞ²¼Ë§Æ½Ó×¸¥ºë¹é±ØÎìÆË°Ç´òÈÓ³âµ©¾ÉÎ´Ä©±¾ÔıÊõÕıÄ¸ÃñÓÀÍ¡Ö­»ãººÃğ·¸ĞşÓñ¹Ï¸ÊÉúÓÃË¦ÌïÓÉ¼×Éêµç°×Æ¤ÃóÄ¿Ã¬Ê¸Ê¯Ê¾ÀñºÌÑ¨Á¢¾À°¬½ÚÌÖÈÃÆıÑµÒéÑ¶¼ÇÔş±ßÁÉÉÁ¼¢Ô¦ÄñÁú¶ªÆ¹ÅÒÇÇÂòÕùÑÇ½»º¥Òà²úÑöÖÙ¼ş¼ÛÈÎ·İ·ÂÆóÒÁÎé¼¿·ü·¥ĞİÖÚÓÅ»ï»áÉ¡Î°´«ÉËÂ×Î±³äÕ×ÏÈ¹âÈ«¹²¹ØĞËÔÙ¾üÅ©±ù³å¾öĞÌ»®ÁĞÁõÔò¸Õ´´ÁÓ¶¯ĞÙ½³¿ï»ªĞ­Ó¡Î£Ñ¹ÑáÓõ³Ô¸÷ºÏ¼ªµõÍ¬ÃûºóÀôÍÂÏòÏÅÂÀÂğ»ØÒòÍÅÔÚ¹çµØ³¡»ø×³¶àÒÄ¿ä¼Ğ¶á¼éËıºÃÈçÍı×±¸¾Âè×Ö´æËïÕ¬ÓîÊØ°²ËÂÑ°µ¼¼â³¾Ò¢¾¡ÒÙÓìËêÆñÖİÑ²¹®·«Ê¦Äê²¢×¯ÇìÑÓÍ¢ÒìÊ½³Úµ±Ã¦ĞçÊùÈÖÏ·³ÉÍĞ¿¸¿ÛÇ¤Ö´À©É¨ÑïÊÕÖ¼ÔçÑ®ĞñÇúÒ·ÓĞÖìÆÓ¶ä»úĞàÉ±ÔÓÈ¨´Î»¶´ËËÀ±ÏÄÊÏ«ÉÇº¹Ñ´Èê½­³ØÎÛÌÀ¼³µÆ»ÒÒ¯Ä²°ÙÆîÖñÃ×ºìÏËÔ¼¼¶¼ÍÈÒÍøÑòÓğÀÏ¿¼¶ø¶úÈâÀß¼¡³¼×ÔÖÁ¾ÊÉàÖÛÉ«ÓóÉÖÃ¢Ö¥³æÑªĞĞÒÂÎ÷¹Û½²»äÑÈĞí¶ïÂÛËÏ·íÉè·Ã¾÷Õê¸º¹ì´ïÇ¨ÓØÆùÑ¸¹ıÂõĞÏÄÇ°îĞ°±ÕÎÊ´³Èî·ÀÑôÒõÕó½×Ò³ÍÔÑ±³ÛÆëÁ½ÑÏ´®ÀöÂÒºàÄ¶²®¹À°éÁæÉìËÅËÆµèµ«Î»µÍ×¡×ôÓÓÌåºÎÓà·ğ×÷ÄãÓ¶¿ËÃâ¶Ò±ø¿öÒ±Àä¶³³õÉ¾ÅĞÅÙÀû±ğÖúÅ¬½ÙÀø¾¢ÀÍÏ»Ò½Â±¼´È´ÂÑÏØ¾ıÁßÍÌÒ÷·Í·ñ°É¶Ö·Ôº¬Ìı¿ÔË±ÆôÖ¨Îâ³³Îü´µÎÇºğÎáÑ½´ô³Ê¸æÄÅÅ»Ô±ÇºÎØ¶ÚÔ°À§´ÑÎ§Ö·¾ù·»Ì®¿²»µ×ø¿Ó¿é¼áÌ³°ÓÎë·Ø×¹Éù¿ÇÈÑ¶Ê¼ËÑıÃîÍ×·Á×ÎĞ¢ËÎÍêºêÊÙÎ²Äò¾ÖÆ¨²ã²í¸ÚµºÏ£ÕÊ±Ó´²ĞòÂ®¿âÓ¦ÆúÅªµÜÕÅĞÎÍ®ÒÛ³¹¼ÉÈÌÖ¾ÍüÓÇ¿ì³ÀĞÃ»³ÎÒ½äÅ¤°ç³¶ÈÅ°â·öÅú¶óÕÒ¼¼³­¾ñ°ÑÒÖÊã×¥Í¶¶¶¿¹ÕÛ¸§Å×¿ÙÂÕÇÀ»¤±¨¾ÜÄâ¸Ä¹¥ºµÊ±¿õ¸ü¸ËÉ¼ÀîĞÓ²Ä´åÕÈ¶ÅÊø¸ÜÌõÀ´Ñî¼«²½¼ßÃ¿Çó¹¯ÍôÌ­ĞÚÆû·ÚÇßÒÊÎÖÉò³ÁÆãÉ³Åæ¹µÃ»Å½Á¤ÂÙ²×»¦·ºÁéÔî¾Ä×ÆÔÖ²ÓÄµÀÎ×´ÓÌ¿ñµÒ±·¾ÁÂê¸¦ÄĞµéÁÆÔí¶¢ÒÓÉçĞãË½Íº¾¿ÇîÏµÎ³´¿É´¸ÙÄÉ×İÂÚ·×Ö½ÎÆ·ÄÅ¦º±Ç¼Ğ¤Öâ¶Ç¸Ø¸Î³¦Á¼Îß½æÂ«·Ò°ÅĞ¾»¨·¼ÇÛÑ¿Î­²ÔËÕ²¹½ÇÑÔÖ¤ÆÀ×çÊ¶Õ©ËßÕïÖß´ÊÒë¹È¶¹¹±²Æ³à×ß×ãÉíĞùĞÁ³½Ó­ÔË½ü·µ»¹Õâ½øÔ¶Î¥Á¬³ÙÒØÓÊºªÇñÉÛ×ŞÁÚÓÏÀïÕë¶¤ÈòÏĞ¼äÃÆ×è°¢ÍÓ¸½¼ÊÂ½Â¤³ÂÈÍ·¹ÒûÇı²µÂ¿¼¦Âó¹êÉ¥¹ÔÈéÊÂĞ©Ïí¾©ÅåÀĞÑğ°Û¼ÑÊ¹Ö¶³ŞÀıÊÌ¶±¹©ÒÀÏÀÂÂ½ÄÕì²àÇÈ¿ëÍÃÆä¾ßµä¾»Æ¾¿­º¯¹Îµ½ÖÆË¢È¯É²´Ì¿Ì¹ô¶ç¼ÁÊÆ±°×ä×¿µ¥ÂôÎÔ¾í²ŞÈş²ÎÊåÈ¡ÄØÖÜÎ¶ºÇÅŞÉëºôÃü¾×ÅØÕ¦ºÍ¾ÌÓ½¸ÀÖä¹¾¿§Áü°¥¹Ì¹úÍ¼ÆÂÀ¤Ì¹ÆºÅ÷¿À´¹À¬Â¢±¸Ò¹ÑÙÆæÄÎ·î·Ü±¼ÄİÃÃÆŞÄ·Ê¼½ã¹ÃĞÕÎ¯ÃÏ¼¾¹ÂÑ§×Ú¹ÙÖæ¶¨ÍğÒË±¦Êµ³èÉóÉĞ¾ÓÇüÌë½ìÑÒÁëÔÀ°¶¿ùÎ×ÅÁÌûÁ±Öã²¯ÖÄĞÒµ×µêÃí¸ı¸®ÅÓ·Ï½¨ÃÖÏÒ»¡Â¼±ËÍùÕ÷¾¶ÖÒÄîºö·ŞÌ¬ËËÕúÅÂ²ÀÁ¯ĞÔ¹ÖÇÓ»ò·¿Ëù³ĞÅêÅûÌ§±§µÖÄ¨Ñº³éÃò·÷Öôµ£²ğÄ´ÄéÀ­°èÅÄÁà¹ÕÍØ°ÎÍÏ¾Ğ×¾ÕĞÂ£¼ğÓµÀ¹Å¡²¦Ôñ·Å¸«Õ¶Íú°ºÀ¥²ıÃ÷»èÒ×ÎôÅó·şº¼±­½ÜËÉ°å¹¹Í÷ÎöÕíÁÖÃ¶¹ûÖ¦ÊàÔæÇ¹·ã¹ñĞÀÅ·ÎäÆçÅ¹Ã¥·ÕÄ­¾ÚºÓ·ĞÓÍÖÎÕÓ¹ÁÕ´ÑØĞ¹Çö²´ÃÚ·¨Å¢Åİ²¨ÆüÄà×¢ÀáÓ¾ĞºÆÃÔóÇ³Â¯´¶Ñ×³´È²¿»ÖË¾æÅÀ°Ö°æÄÁÎïºü¹·¾ÑÄüÍæÃµ»·ÏÖÎÍ»­³©¸í¾ÎÅ±ÑñµÄÓÛÃ¤Ö±ÖªÎù·¯¿óÂëÆí¸Ñ±ü¿ÕÏßÁ·×éÉğÏ¸Ö¯ÖÕ°íÉÜÒï¾­ÂŞÕßÒ®Ëà¹ÉÖ«·ô·Ê¼ç·¾°¹¿ÏÓı·ÎÉöÖ×ÕÍĞ²Éá¼èÔ·Ì¦Ãç¿Á°ú¹¶Èô¿àÉ»±½Ó¢Æ»×ÂÃ¯·¶ÇÑÃ©¾¥»¢Â²Ê­±íÉÀ³Ä¹æÃÙÊÓÊÔÊ«³ÏÖï»°µ®¹îÑ¯Òè¸ÃÏê²ïÔğÏÍ°ÜÕË»õÖÊ··Ì°Æ¶±á¹ºÖü¹á×ªÂÖÈíºäÌöµÏÆÈµüÊöÓô½¼ÀÉÖ£²É½ğÇ¥·°µöÕ¢ÄÖ¸·ÂªÄ°½µÏŞÉÂÁ¥ÓêÇà·Ç¶¥Çê½¤ÊÎ±¥ËÇÊ»¾Ô×¤ÍÕ¼İÓãÃù³İÁÙ¾ÙÍ¤ÁÁÇ×ÎêºîÇÖ±ã´Ù¶í¿¡ÇÎÀşË×·ı±£ÓáĞÅÁ©¼óĞŞ×ÈÑøÃ°¹ÚÌêÏ÷Ç°¹Ğ½£²ªÓÂÃãÑ«ÄÏĞ¶ÀåºñÊÜ±äĞğÅÑ×ÉÒ§¿©ÔÛ¿ÈÏÌÑÊ°§Æ·ºå¶ßÍÛ¹şÔÕÏìÑÆ»©Ó´ÄÄĞÍÀİ¶â¹¸Ô«¿Ñµæ¿å³Ç¸´¿ü×àÆõ½±Ò¦½ªÀÑÒÌÒö×ËÍşÍŞÂ¦½¿ÄÈº¢ÂÏ¿ÍĞûÊÒ»ÂÏÜ¹¬·â½«³¢ÎİÊºÆÁÖÅÏ¿ÂÍ²îÏïµÛ´øÖ¡°ïÓÄ¶ÈÍ¥ÍäÑå±ë´ıºÜ»²ÂÉÔõÅ­Ë¼µ¡¼±Ô¹×ÜÊÑ»Ğºã»ÖĞôºŞ¶²ÌñÄÕÕ½±â°İÀ¨ÊÃÕü¹°Ë©¿½Æ´×§Ê°³Ö¹ÒÖ¸°´¿æÌôÍÚÎÎÌ¢Ğ®ÄÓµ²Õõ¼·»ÓÅ²Í¦Õş¹ÊÊ©¼ÈĞÇÓ³´ºÃÁ×òÕÑÊÇÖçÏÔ¿İ¼Ü¼Ï±ú°ØÄ³¸ÌÆâÈ¾Èá×õÄû²é¼í¿ÂÖùÁøÊÁÕ¤±êÕ»¶°À¸Ê÷ÍáÑê´ù²Ğ¶Î¶¾±ÑÅşÕ±·úÇâÈª±Ã½àÑóÈ÷Ï´Âå¶´½òºé¶ıÖŞ»îÍİÇ¢ÅÉ½½×Ç²â¼Ã»ëÅ¨ÏÑÌ¿ÅÚ¾¼±şÕ¨µãÁ¶³ãË¸ÀÃÌşÉüÇ£ºİ½Æ¶ÀÏÁÊ¨ÕøÓüÁá²£ÉºÕä·©Éõ±Â½çÎ·°Ì½êÒß´¯·è¹ï½Ô»ÊÖÑÅèÓ¯ÏàÅÎ¶ÜÊ¡Ã¼¿´Õ£¾ØÉ°Æö¿³ÅøÑĞ×©Ñâ×æ×£ÉñÓíÇïÖÖ¿ÆÃë´©Í»ÇÔÊú¸ÍÀà×Ñ°óÈŞ½áÈÆ»æ¸øÑ¤Âç¾ø½ÊÍ³¸×·£ÃÀË£ÄÍÎ¸µ¨±³Ì¥ÅÖÅßÊ¤°ûºúÂö¼ë´ÄÃ£²çÒğ²èÈ×Èã¾£²İ¼ö»ÄÀó¼Ôµ´ÈÙ»çÓ«ÒñÒ©Å°ºçËäÏºÊ´ÒÏÂìÔéÑÜ°ÀÒªÀÀ¾õ½ëÎÜÓïÎóÓÕ»åËµËĞ·¡¼úÌù¹ó´ûÃ³·ÑºØ¸°ÕÔÅ¿ÖáÇáÃÔ±Å¼£×·ÍËËÍÊÊÌÓÄæÑ¡Ñ·ºÂ¿¤ÔÇÇõÖØ¸Æ¶Û³®ÖÓÄÆ±µ¸ÖÔ¿ÇÕ¾ûÎÙ¹³Å¥¹ëÎÅÃö·§¸óºÒ±İ¶¸Ôº³ıÔÉÏÕÃæ¸ï¾ÂÒôÏîË³ĞëÊ³¶üÈÄ½È±ıÊ×ÏãÂî½¾Âæº§¹Ç¹íÅ¸Ñ»³Ë¸©¾ã°³±¶µ¹¾óÌÈºòÒĞ½è³«¾ëÄßÕ®ÖµÇã½¡µ³¼æÔ©Æà×¼Á¹µòÁèÌŞÆÊ°ş¾ç·ËÄäÇäÔ­¸çÅ¶ÉÚÁ¨¿ŞÏøÕÜ²¸ºßÑäËô´½°¦ÌÆ»½°¡ÆÔÔ²¹¡°£ÂñÆÒºøÏÄÌ×¼§Äï¾êÉï¶ğÃäÓéÔ×º¦ÑçÏü¼ÒÈİ¿í±öÉäĞ¼Õ¹¶ëÓøÇÍ·å¾şÏ¯×ùÈõĞìÍ½Áµ¿ÖË¡¶÷¹§Ï¢¿Ò¶ñÇÄº·»ÚÎòÔÃÃõÉÈÈ­ÄÃÖ¿ÂÎ°¤´ìÕñÍìÎæÍ±À¦×½°Æº´ÉÓÄó¾è²¶ÀÌËğ¼ñ»»µ·Ğ§µĞ°½Õ«ÁÏÅÔÂÃ»Î½úÉÎÉ¹ÏşÔÎÍíË·ÀÊ²ñË¨ÆÜÀõĞ£ÖêÑùºË¸ù¸ñÔÔ¹ğÌÒÎ¦¿ò°¸×ÀÍ©É£»¸½ÛµµÇÅ½°×®°ğÉÒÎàÀæÑ³ÊâÒó±Ğº¤Ñõ°±Ì©Á÷½¬Õã¿£ÆÖºÆÀË¸¡Ô¡º£½şÍ¿ÄùÏûÉæÓ¿ÌéÌÎÀÔÁ°ÎĞ»ÁµÓÈó½§ÕÇÉ¬ÁÒºæÀÓÖòÑÌ¿¾·³ÉÕ»âÌÌ½ıÈÈ°®µùÌØÎşÀêÀÇÖé°àÆ¿´ÉÅÏÁôĞóÆ£ÕîÌÛ¾Ò¼²²¡Ö¢Ó¸¾·¸ŞÖåÒæ°»ÕµÑÎ¼àÕæÃßÑ£ÕèÅéÆÆÉéÔÒÀù´¡ËîÏéÀëÃØ×â³ÓÇØÑíÖÈ»ı³ÆÕ­ÇÏÕ¾¾º°ÊËñĞ¦±Ê·ÛÎÉËØË÷½ô¾îĞåËçÌĞ¼ÌÈ±°Õ¸áĞßÎÌ³á¸ûºÄÔÅ°ÒËÊ³Üµ¢¹¢Äô¿èÒÈ¸ì½ºĞØ°·ÄÜÖ¬´à¼¹ÔàÆêÄÔÅ§³ôÖÂÒ¨º½°ã½¢²ÕÑŞºÉÆÎÀòÉ¯ÄªÀ³Á«»ñÓ¨Ã§ÂÇÎÃ°ö²ÏÑÁË¥ÖÔÔ¬ÅÛÌ»ĞäÍà±»ÇëÖîÅµ¶Á·Ì¿ÎË­µ÷ÁÂ×»Ì¸Òê±ª²òÔô¼Ö»ßÁŞÂ¸Ôß×Ê¸ÏÆğ¹ªÔØ½Î½ÏÈèÍ¸ÖğµİÍ¾¶ºÍ¨¹äÊÅ³ÑËÙÔì·ê²¿¹ù³»µ¦¶¼×ÃÅä¾Æ¸ªÇ®Ç¯²§×ê¼ØÓËÌú²¬ÁåÇ¦Ã­ÔÄÅãÁêÌÕÏİÄÑÍç¹Ë¶Ù°äËÌÔ¤¶öÄÙ³ÒÑé¿¥¸ßÑ¼ÑìÔ§ÍÒÇ¬¼ÙÆ«×öÍ£Å¼Íµ³¥¿ş¶µÊŞÃá¼õ´Õ»Ë¼ô¸±ÀÕ¿±³×Ïá¾Ç»£ÊÛÎ¨³ªÍÙ¿Ğ×ÄÉÌ·ÈÆ¡É¶À²Å¾ÄöĞ¥È¦Óò²ºÅà»ùÌÃ¶ÑÇµ¶é¶Â¹»ÉİÈ¢ÆÅÍñ»éÀ·Ó¤ÉôÊëËŞ¼Å¼ÄÒúÃÜ¿ÜÎ¾ÍÀ³çÆé´ŞÑÂ±ÀÕ¸³²³£Êü¿µÓ¹ÀÈµ¯²Ê±òµÃÅÇÓÁÏ¤ÓÆ»¼ÄúĞü¼Âµ¿Çé¾ªÍïÌèÏ§Î©µë¾å²Ò²Ñµ¬¹ßÆİÅõ¾İ´·½İÄíÏÆµà¶ŞÊÚµôÌÍÆşÅÅÒ´¾òÂÓÌ½½Ó¿ØÍÆÑÚ´ëÂ°ÖÀµ§²ôÃô¾È½ÌÁ²±Ö¸ÒĞ±¶ÏĞı×åÎî»Ş³¿²ÜÂüÍûÍ°ÁºÃ·¹£ÃÎËóÌİĞµÊá¼ìÓûºÁ¸¢ÑÄÒºº­ºÔµí×ÍÏıÁÜÌÊÊçÄ×ÌÔµ­ÓÙÒù´ã»´Éî´¾»ìÑÍÌíÇåÔ¨×Õ½¥ÓæÉøÇşÏ©ÍéÅë·éÑÉº¸»ÀË¬ÀçÁÔ²şÃÍ²ÂÖíÃ¨ÂÊÇòÀÅÀíÁğËöÌğÂÔÆè´ÃÈ¬Ñ÷ÖÌºÛ°¨ºĞ¿ø¸ÇµÁÅÌÊ¢ÃĞ¿ô¾ìÌ÷ÑÛ×ÅÕö½Ã¹èÎøË¶Æ±¼Àµ»»ö½ÕÒÆ»àÒ¤ÖÏ¾¹ÕÂµÑ·û±¿µÚ¼ãÁıÁ£ÆÉ´ÖÕ³ÀÛ¼¨Ğ÷Ğø´ÂÉşÎ¬Ãà±Á³ñ×ÛÕÀÂÌ×ºÁçÒîÁÄÁûÖ°²±½Å¸¬ÍÑÁ³¶æ²°ÏÏ´¬¹½¾Õ¾úºÊ²Ë²¤ÆĞÁâ·ÆÌÑÃÈÆ¼Î®ÂÜÓ©ÓªÏôÈøÖøĞéÖûÇùÉß¹Æµ°ĞÆÏÎ´üÏ®¸¤Ä±µı»ÑĞ³Î½²÷ÑèÃÕÏóÉŞÉâÖºÔ¾¾àÇû¸¨Á¾´şÒİÂß¶õĞï·ÓÔÍÌªÒ°Í­ÂÁÕ¡Ï³¸õÃú½ÂÒ¿²ùÒøÑËÑÖ²ûÓçÂ¡ËåËæÒşÈ¸Ñ©Â­ÁìÆÄ¾±ÏÚ¹İÆï¸ëºèÂ¹Âé»Æ¹¨¸µÀü°ø´ö´¢°ÁÔäÊ£¸îÄ¼²©ÏÃ³øÌä¿¦Î¹ÉÆÀ®ºíº°´­Ï²ºÈĞúÔûÅçÓ÷±¤µÌ¿°ÑßËşÒ¼µì°ÂĞöÃ½ÃÄÉ©¸»ÃÂº®Ô¢×ğ¾ÍÊôÂÅÇ¶Ã±Ãİ·ùÇ¿ÅíÓùÑ­±¯»ó»İ³Í±¹¶è»ÌÈÇĞÊÓä·ßÀ¢»Å¿®ÕÆ³¸Èà×áÃèÌá²åÒ¾ÎÕ´§¿«¾¾½ÒÔ®À¿²ó¸éÂ§½Á´êÉ¦ËÑ´î²ë³¨É¢¶Ø¾´±ó°ßË¹ÆÕ¾°ÎúÇç¾§ÖÇÁÀÔİÊîÔøÌæ×î³¯ÆÚÃŞÆå¹÷°ô×Ø¼¬ÅïÌÄÉ­Àâ¿Ã¹×ÒÎÖ²×µ½·ÍÖÒ¬ÀÆÆÛ¿îÖ³ÌºµªÂÈÇèÓå¶ÉÔü²³ÎÂÎ¼¸Û¿ÊÓÎÃìÅÈÍÄºşÏæÕ¿ÍåÊªÀ£½¦¸È³ü×Ì»¬ÖÍ±º·Ù½¹ÑæÈ»ÖóÅÆÏ¬¶¿ĞÉºï»«×ÁÁÕÇÙÅıÅÃÇíÉû·¬³ëÊè¶»Í´Æ¦Á¡»¾µÇÍî¶ÌÏõÁòÓ²È·¼ïÂ»ÇİÏ¡³ÌÉÔË°½Ñ´°¾½´ÜÎÑ¿¢Í¯µÈ½î·¤¿ğÖşÍ²´ğ²ßÉ¸ËÚÔÁÖà·à×ÏĞõ¼êÃåÀÂ¼©¶Ğ»ºµŞÂÆ±àÔµÏÛÏèÇÌÁªÆ¢ÌóÀ°Ò¸¸­Ç»ÍóÊæË´Í§Âä¸ğÆÏ¶­ºùÔá´Ğ¿ûµÙ½¯»×ÍÜÖë¸òÂùÕİÑÑ½Ö²ÃÁÑ×°Ô£È¹¿ãĞ»Ò¥°ùÇ«¸³¶ÄÊêÉÍ´ÍÅâ³Ã³¬Ô½Ç÷°ÏµøÅÜ¼ù±²»Ô¹õ¹¼±ÆÓâ¶İËìÓö±é¶ôµÀÒÅº¨ËÖÓÔÊÍÁ¿ÖıÆÌÁ´ÏúËø³ú¹øĞâ·æĞ¿ÈñÌàÀ»À«¸ô°¯Ï¶ÑãĞÛÑÅ¼¯¹Íº«¼ÕÀ¡²öÆ­É§Â³¾é¶ìÊòºÚ¶¦´ßÉµÏñ½ËÇÚµşĞáÉ¤ÊÈÎËËÃËúËÜÌÁÈûÌîÄ¹Ï±¼Ş¼µÏÓÇŞÄ¯»ÏÄ»Á®ÀªÎ¢Ïë³îÓúÒâÓŞ¸Ğ´ÈÉ÷Éå²«´¤¸ãÌÂ°áĞ¯Éã°ÚÒ¡±÷Ì¯ÃşÊıÕåĞÂÏ¾Å¯°µ´ª´»Ğ¨³şÀã¿¬Â¥¸ÅÓÜ»±Ğª¸èµî»ÙÔ´ÁïÒçÏªËİÈÜÄçµá×ÒÌÏ¹öÂúÂËÀÄÂĞ±õÌ²ÀìÄ®»Í¼åÉ·ÃºÕÕÏ×Ô³º÷ÈğÉª¹åÕç»ûÌµ³Õ±Ô´áÃË¾¦Ë¯¶½ÄÀ½Ş²Ç¶ÃÃé°«ÅğµïÂµ°­Ëé±®ÍëµâÅö½û¸£°ŞÖÉ³í¿ß¿ú¿ê³ïÇ©¼òÁ¸Á»¾¬¸¿·ì²øÕÖ×ïÖÃÊğÈºÆ¸ÒŞËÁĞÈÈùÑü¸¹ÏÙÄåÌÚÍÈ¾ËÃÉËâÆÑÕôĞîÈØËò±ÍÀ¶¼»ÅîÓİÓ¼¶ê·äÍÉÎÏÑÃÒáÂã¹Ó½â´¥Õ²ÓşÌÜ½÷Ã¡Ãı»¿ºÑÀµ¸ú¿ç¹òÂ·Ìø¶å¶ã·ø¼­Êä´Ç±ÙÇ²Ò£±ÉÀÒ³êÍª½´¼øÕà´íÃªÎıÂà´¸×¶½õÏÇ¶§¼ü¾âÃÌÕÏÓº³ûÁãÀ×±¢Îí¾¸½ùÑ¥°ĞÔÏÒÃÆµÍÇÓ±Áó¿ı»ê±«ÈµÅô¹ÄÊóÁäÁÅÉ®ËÛ¾¤µÊËÔ¼Î¸ÂĞêÂï¾³ÊûÉÊÇ½µÕÄÛ·õ²ì¹ÑÁÈÕ¯ÁÎ±×ÕÃÔ¸Ä½Âı¿¶½ØË¤Õª´İÄ¡ÁÌÆ²ÇÃÎÓÆì°ñÕ¥ÁñÈ¶¼÷Ä£Ç¸µÎÆ¯ÆáÂ©ÑİÂşÊşÕÄÑúÎ«É¿Ï¨ĞÜÑ¬ÈÛÎõ°¾ÑşÁ§ÒÉÎÁÊİ´ñ³òµú±Ì¼îÌ¼²ê´Å´èÎÈ½ß¶Ë¹¿²­»şËã¹ÜÂá´â¾«Ó§ËõµÔ´ä¾ÛÕØ¸¯°ò²²¸àÄ¤ÓßÌòÎèÃïÂûÕáÎµ²ÌÄèÇ¾°ª±ÎÊñÖ©ÃÛÀ¯Ó¬²õÉÑÅá¹üºÖÍÊÊÄÌ·À¾Æ×ºÀÃ²×¸×¬ÈüºÕÓ»³ìÔ¯Ï½Õ·À±ÔâÕÚ½ÍÃ¸¿áËáÄğÇÂ¶Í¶ÆÃ¾Ëí´ÆĞè¾²ÉØ¿ÅÂøÂâÆÇÏÊ±Ç½©Æ§ÁİÅüÖö³°Ë»ÎûºÙÒ­¸ÁÔöĞæÄ«¶ÕÂÄ´±Ó°µÂ»ÛÎ¿±ïÔ÷º©¶®Â¾Ä¦¾ï³ÅÈöËº×²³·ÁÃÇË²¥´é×«ÄìÇÜ·óÄº±©²Û·®ÕÁºáÓ£ÏğÒãÅËÇ±ÁÊÌ¶³±³Î³ºÅìÀ½°ÄÊìÁö±ñÌ±Ï¹Â÷Äë°õÀÚÅÍ¿Äµ¾¼Ú»ü¸å¼ıÏä×­ÆªÂ¨ºıÉÉ´Ï±ìÌÅÏ¥ËÒÊß½¶ÈïÔÌĞ«»Èºûµû°ıÈìÇ´ÍãÔ¥ÌËÈ¤Ì¤¾áÌß²È×ÙÌÉ×ñ´¼×í´×ÕòÄ÷Äø¸ä°÷ÏöÕğÃ¹¿¿Ğ¬°°ÌâÑÕ¶îÆ®º¡Àğº×ÀèÈå¼½Äı×ìÆ÷ÔëÊÉ±Úº¶Ğ¸°ÃÀÁº³ÀŞÉÃ²ÙÇæËÓÕûÇÁ³È³÷ÂºÔè¼¤±ôÈ¼ÁÇÑàÌ¡Æ°ÕÎÈ³Æ³Ä¥»ÇÄÂÁş¸İ´ÛÀºÀéÅñ¸âÌÇ²Ú½Éº²°¿ÅÕÅòÉÅÕéÀÙ±¡Ñ¦Ğ½ÊíÈÚÃøºâÔŞÔùÌãÕŞ±æ±ç±ÜÑûĞÑÃÑÈ©¾µµñ»ôÄŞÁØµåÇÊµß²Í¾¨Ç­Ä¬ÀÜº¿Ìçº¾Èæ»ÕÅ³´÷²ÁÊïÌ´Ï­ÃÊÔï¾ô°©ÇÆÖõµÉË²Í«Á×½¸Ëë´Ø»ÉÃÓÔã¿··±ÒíÍÎ±ÛÓ·ÒÜ½å²ØÃêÂİÏå»íÉÄÓ®µ¸Ì£±èÁÍËªÏ¼¾ÏÖèÎºÈúÈ£ÏùÒÍ´ÁÆÙÕ°·­ÅºÌÙ·ª½ó¸²±Ä³ùÀØÁ­±Ş××Ó¥ÄõÅÊÔÜÆØ±¬°ê½®Ñ¢²¾¸şÔåÄ¢Ğ·¾¯µÅ²ä¶×´ÚÃÒ²ü±îÂ´ÈÂ½ÀÈÀÎ¡ÈÁ¹à¼®Å´×ëÒ«ÈäÆ©ÔêÄ§ÁÛ´À¸ÓÂ¶°ÔÅùËèÄÒÈ¿ÕºÏâ¾ğ¹ŞÈ§´£";
function judge_CN(char1,char2,mode){
	var charSet=charMode?charPYStr:charBHStr;
	for(var n=0;n<(char1.length>char2.length?char1.length:char2.length);n++){
		if(char1.charAt(n)!=char2.charAt(n)){
			if(mode) return(charSet.indexOf(char1.charAt(n))>charSet.indexOf(char2.charAt(n))?1:-1);
			else	 return(charSet.indexOf(char1.charAt(n))<charSet.indexOf(char2.charAt(n))?1:-1);
			break;
		}
	}
	return(0);
}



// Êı×ÖÑéÖ¤
function numberCheckMe(obj){
if (trim(obj.value)=="") {
 		obj.value = "0.0000";
 		return;
}
 if (!IsNumber(trim(obj.value))) {
   showAlert("ÄúÊäÈëÁË·ÇÊı×Ö·ûºÅ£¬ÇëÖØĞÂÊäÈë!");
   obj.value = comdecimal(round(0.0/1.0,2));
   obj.focus();
   return;
 }
	obj.value = comdecimal(round(obj.value/1.0,2));
}



    /**
    * »ñÈ¡¸ø¶¨ÈÕÆÚºóÏà¼ä¸ôµÄÈÕÆÚ
    *
    * @dateString   ¸ø¶¨µÄÈÕÆÚ×Ö´®(±ØĞëÊÇDate.parse()¿ÉÒÔ½âÎöµÄÀàĞÍ)      ¿ÉÒÔÎªnull,Èç¹ûÎªnullÔò±íÊ¾È¡µ±Ç°ÈÕÆÚ
    * @interval     Ê±¼ä¼ä¸ô(Õı¸º¶¼¿ÉÒÔ)   ²»Îª¿Õ»ònull
    * @dateField    È¡Öµ1¡¢2¡¢3¡¢4¡¢5¡¢6£¬ÆäÖĞ1´ú±íyear¡¢2´ú±ímonth¡¢3´ú±íday¡¢4´ú±íhours¡¢5´ú±íminutes¡¢6´ú±íseconds  ²»Îª¿Õ»ònull
    */
    function getDate(dateString,interval,dateField){
        var tempDate;
        //È¡µ±Ç°ÈÕÆÚ
        if(dateString==null){
           tempDate=new Date();
        } else {
           tempDate=new Date(dateString);
        }

        switch(dateField){
            case 1:
                tempDate.setFullYear(tempDate.getFullYear()+interval);
                break;
            case 2:
                tempDate.setMonth(tempDate.getMonth()+interval);
                break;
            case 3:
                tempDate.setDate(tempDate.getDate()+interval);
                break;
            case 4:
                tempDate.setHours(tempDate.getHours()+interval);
                break;
            case 5:
                tempDate.setMinutes(tempDate.getMinutes()+interval);
                break;
            case 6:
                tempDate.setSeconds(tempDate.getSeconds()+interval);
                break;
        }
        //alert("ÈÕÆÚÎª="+tempDate.toGMTString());
        return tempDate;
    }


/*
ÓÃÍ¾£º¼ì²éÊäÈë×Ö·û´®ÊÇ·ñÖ»ÓÉºº×Ö×é³É
Èç¹ûÍ¨¹ıÑéÖ¤·µ»Øtrue,·ñÔò·µ»Øfalse
*/

function f_check_zh(obj){
	if (/^[\u4e00-\u9fa5]+$/.test(obj.value)) {
	  return true;
	}
	showAlert("ÇëÊäÈëºº×Ö!");
	return false;
}

/**
 * È¡µÃselectÁĞ±íÖĞÖµµÈÓÚobj.valueµÄÃû³Æ
 * 
 */ 
function getValueFromSelectOptions(obj) {
	var length = obj.length;
	if (length == 1) {
	    return obj.options[0].text;	    	    	    	
	} else {
		for (var i = 0; i < length; i ++) {
			if (obj.options[i].value == obj.value) {
				return obj.options[i].text;	 
			}
		}
	} 
	return null;    
}

 //×óÓÒÀ¨ºÅÒªÆ¥Åä
 function matchBracket(str) {
	var leftB = 0;
	for (var i = 0; i < str.length; i++)
	{
		if (str.charAt(i) == '(')
		{
			leftB++;
		}
		if (str.charAt(i) == ')')
		{
			leftB--;
		}
	}
	//alert(str + " " + leftB);
	return leftB == 0 ? true : false;
 } 

	//*******************StringÀàĞÍµÄÁ½¸öÈÕÆÚ´óĞ¡µÄ±È½Ï,¹æÔòÊÇfirstDate²»ÄÜ´óÓÚendDate********************//
function compareDates(firstDate,endDate){
    var firstDates = firstDate.split("-");
    var endDates  = endDate.split("-");
    var dateOne = new Date(firstDates[0],firstDates[1],firstDates[2]);
    var dateTwo = new Date(endDates[0],endDates[1],endDates[2]);
    if(dateOne>dateTwo){
       return false;
    }
    else{
      return true;
    }
}

function DigitInput(el,e) {
    //8£ºÍË¸ñ¼ü¡¢46£ºdelete¡¢37-40£º ·½Ïò¼ü
    //48-57£ºĞ¡¼üÅÌÇøµÄÊı×Ö¡¢96-105£ºÖ÷¼üÅÌÇøµÄÊı×Ö
    //110¡¢190£ºĞ¡¼üÅÌÇøºÍÖ÷¼üÅÌÇøµÄĞ¡Êı
    //189¡¢109£ºĞ¡¼üÅÌÇøºÍÖ÷¼üÅÌÇøµÄ¸ººÅ
    var e = e || window.event; //IE¡¢FFÏÂ»ñÈ¡ÊÂ¼ş¶ÔÏó
    var cod = e.charCode||e.keyCode; //IE¡¢FFÏÂ»ñÈ¡¼üÅÌÂë
    //Ğ¡Êıµã´¦Àí
    if (cod == 110 || cod == 190){
        (el.value.indexOf(".")>=0 || !el.value.length) && notValue(e);
    } else {
        if(cod!=189 && cod != 109 && cod!=8 && cod != 46 && (cod<37 || cod>40) && (cod<48 || cod>57) && (cod<96 || cod>105)) notValue(e);
    }
    function notValue(e){
        e.preventDefault ? e.preventDefault() : e.returnValue=false;
    }
}

//timeFlag : true,·µ»ØÄêÔÂÈÕÊ±·ÖÃë£¬false£¬Ö»·µ»ØÄêÔÂÈÕ
function getNow(timeFlag){ 
	var now = new Date(); 
	var yy = now.getFullYear(); 
	var mm = now.getMonth(); 
	var dd = now.getDate();
	var hour=now.getHours() < 10 ? "0"+now.getHours() : now.getHours();
	var minute=now.getMinutes() < 10 ? "0"+now.getMinutes() : now.getMinutes();
	var second=now.getSeconds() < 10 ? "0"+now.getSeconds() : now.getSeconds();
	var mmm=new Array();
	mmm[0]="01";
	mmm[1]="02";
	mmm[2]="03";
	mmm[3]="04";
	mmm[4]="05";
	mmm[5]="06";
	mmm[6]="07";
	mmm[7]="08";
	mmm[8]="09";
	mmm[9]="10";
	mmm[10]="11";
	mmm[11]="12";
	mm=mmm[mm];
	dd = dd < 10 ? ("0" + dd) : (""+dd);
	var time = yy + "-" + mm +"-"+dd ;
	if (timeFlag) {
		time += " " + hour + ":" + minute
	}
	return time;
}

function setStopPropagation(e) { 
   e = e||event;/* get IE event ( not passed ) */ 
   e.stopPropagation ? e.stopPropagation() : e.cancelBubble = true; 
}

function checkAllJGridChk(e,obj,name) {
	setStopPropagation(e);
	$("[name='"+name+"']:visible:enabled:checkbox").attr("checked", obj.checked);
}